In [1]:
import pandas as pd
import numpy as np

In [2]:
csv = pd.read_csv("data.csv",sep="\t")

In [3]:
csv.head()

   ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001     150.50  2012-10-05         3002         5002
1   70009     270.65  2012-09-10         3001         5003
2   70002      65.26  2012-10-05         3001         5001
3   70004     110.50  2012-08-17         3003         5003
4   70007     948.50  2012-09-10         3002         5002

In [4]:
len(csv)

12

In [5]:
# the dataset contains data of 12 orders

In [6]:
# Group by customers to be able to analysis the purchase history of each customer
# this can be used to find out when each customer buys , what's the category of items that
# the customer is interested in ,
#  the average of each customer orders can be used to predict 
#  the value of the future orders of the customer
# time and date can be a critical factor depends on the data we have

In [7]:
grouped_customers = csv.groupby("customer_id")

In [8]:
grouped_customers_df = grouped_customers.describe()
grouped_customers_df

            ord_no                                                           \
             count      mean       std      min      25%      50%       75%
customer_id
3001           4.0  70008.00  4.546061  70002.0  70006.5  70008.5  70010.00
3002           4.0  70006.25  4.573474  70001.0  70004.0  70006.0  70008.25
3003           3.0  70006.00  4.358899  70003.0  70003.5  70004.0  70007.50
3004           1.0  70010.00       NaN  70010.0  70010.0  70010.0  70010.00

                     purch_amt             ...                    salesman_id  \
                 max     count       mean  ...       75%      max       count
customer_id                                ...
3001         70013.0       4.0  2285.3775  ...  3724.200  5760.00         4.0
3002         70012.0       4.0   937.5125  ...  1311.525  2400.60         4.0
3003         70011.0       3.0   888.7300  ...  1295.450  2480.40         3.0
3004         70010.0       1.0  1983.4300  ...  1983.430  1983.43         1.0


                mean  std     min      25%     50%     75%     max
customer_id
3001         5001.50  1.0  5001.0  5001.00  5001.0  5001.5  5003.0
3002         5001.75  0.5  5001.0  5001.75  5002.0  5002.0  5002.0
3003         5003.00  0.0  5003.0  5003.00  5003.0  5003.0  5003.0
3004         5003.00  NaN  5003.0  5003.00  5003.0  5003.0  5003.0

[4 rows x 24 columns]

In [9]:
grouped_customers_df.drop(["ord_no","salesman_id"],axis=1,inplace=True)
grouped_customers_df

            purch_amt                                                        \
                count       mean          std      min        25%       50%
customer_id
3001              4.0  2285.3775  2685.702166    65.26   219.3025  1658.125
3002              4.0   937.5125  1037.977089   150.50   225.4625   599.475
3003              3.0   888.7300  1378.539074    75.29    92.8950   110.500
3004              1.0  1983.4300          NaN  1983.43  1983.4300  1983.430


                  75%      max
customer_id
3001         3724.200  5760.00
3002         1311.525  2400.60
3003         1295.450  2480.40
3004         1983.430  1983.43

In [33]:
# mean purchase value of each customer
pd.DataFrame(grouped_customers_df["purch_amt"]["mean"])

                  mean
customer_id
3001         2285.3775
3002          937.5125
3003          888.7300
3004         1983.4300

In [35]:
# Mamimium purchase value of each sutomer
pd.DataFrame(grouped_customers_df["purch_amt"]["max"])

                 max
customer_id
3001         5760.00
3002         2400.60
3003         2480.40
3004         1983.43

In [36]:
# Number of orders created by each customer 
pd.DataFrame(grouped_customers_df["purch_amt"]["count"])

             count
customer_id
3001           4.0
3002           4.0
3003           3.0
3004           1.0

In [10]:
print(f"The maximum number of orders created by a customer {grouped_customers_df['purch_amt']['count'].max()}")
print(f"The maximum number of orders created by a customer {grouped_customers_df['purch_amt']['count'].min()}")

The maximum number of orders created by a customer 4.0
The maximum number of orders created by a customer 1.0

In [11]:
print(f"The most expensive order created by a customer {grouped_customers_df['purch_amt']['max'].max()}")
print(f"The least expensive order created by a customer {grouped_customers_df['purch_amt']['max'].min()}")

The most expensive order created by a customer 5760.0
The least expensive order created by a customer 1983.43

In [27]:
for i in range(len(grouped_customers_df)):
    print(f" Customer Number = {i+1}")
    print(f"number of orders ordered by this customer = {grouped_customers_df.iloc[i]['purch_amt']['count']}")
    print(f"The mean value of the orders = {grouped_customers_df.iloc[i]['purch_amt']['mean']}")  
    print(f"The most expensive order created by this customer {grouped_customers_df['purch_amt']['max'].max()}")
    print("\n")

 Customer Number = 1
number of orders ordered by this customer = 4.0
The mean value of the orders = 2285.3775
The most expensive order created by this customer 5760.0


 Customer Number = 2
number of orders ordered by this customer = 4.0
The mean value of the orders = 937.5124999999999
The most expensive order created by this customer 5760.0


 Customer Number = 3
number of orders ordered by this customer = 3.0
The mean value of the orders = 888.73
The most expensive order created by this customer 5760.0


 Customer Number = 4
number of orders ordered by this customer = 1.0
The mean value of the orders = 1983.43
The most expensive order created by this customer 5760.0

In [13]:
salesmans_grouped = csv.groupby("salesman_id")
salesmans_grouped

In [14]:
salesmans_grouped_df = salesmans_grouped.describe().drop(["ord_no","customer_id"],axis=1)

In [15]:
salesmans_grouped_df

            purch_amt                                                       \
                count         mean          std     min       25%      50%
salesman_id
5001              4.0  2817.865000  2342.289902   65.26  1816.765  2723.10
5002              3.0   449.816667   434.754299  150.50   200.475   250.45
5003              5.0   984.054000  1154.956450   75.29   110.500   270.65


                  75%     max
salesman_id
5001         3724.200  5760.0
5002          599.475   948.5
5003         1983.430  2480.4

In [38]:
# Mamimium sales by each salesman
pd.DataFrame(salesmans_grouped_df["purch_amt"]["max"])

                max
salesman_id
5001         5760.0
5002          948.5
5003         2480.4

In [39]:
# minimum sales by each salesman
pd.DataFrame(salesmans_grouped_df["purch_amt"]["min"])

                min
salesman_id
5001          65.26
5002         150.50
5003          75.29

In [40]:
# mean sales by each salesman
pd.DataFrame(salesmans_grouped_df["purch_amt"]["mean"])

                    mean
salesman_id
5001         2817.865000
5002          449.816667
5003          984.054000

In [41]:
# Numbers of orders sold by each salesman
pd.DataFrame(salesmans_grouped_df["purch_amt"]["count"])

             count
salesman_id
5001           4.0
5002           3.0
5003           5.0

In [16]:
print(f"The maximum number of orders sold by a salesman {salesmans_grouped_df['purch_amt']['count'].max()}")
print(f"The minimum number of orders created by a salesman {salesmans_grouped_df['purch_amt']['count'].min()}")

The maximum number of orders sold by a salesman 5.0
The minimum number of orders created by a salesman 3.0

In [159]:
print(f"The most expensive order sold by a salesman {salesmans_grouped_df['purch_amt']['max'].max()}")
print(f"The least expensive order sold by a salesman {salesmans_grouped_df['purch_amt']['max'].min()}")

The most expensive order sold by a salesman 5760.0
The least expensive order sold by a salesman 948.5

In [26]:
for i in range(len(salesmans_grouped_df)):
    print(f" Salesman Number = {i+1}")
    print(f"number of orders sold by this salesman = {salesmans_grouped_df.iloc[i]['purch_amt']['count']}")
    print(f"The mean value of the orders = {salesmans_grouped_df.iloc[i]['purch_amt']['mean']}")  
    print(f"The most expensive order created by this customer {salesmans_grouped_df['purch_amt']['max'].max()}")
    print("\n")

 Salesman Number = 1
number of orders sold by this salesman = 4.0
The mean value of the orders = 2817.8650000000002
The most expensive order created by this customer 5760.0


 Salesman Number = 2
number of orders sold by this salesman = 3.0
The mean value of the orders = 449.81666666666666
The most expensive order created by this customer 5760.0


 Salesman Number = 3
number of orders sold by this salesman = 5.0
The mean value of the orders = 984.0539999999999
The most expensive order created by this customer 5760.0